app/controllers/books_controller.rb

    def index
        @books = Book.order(:author)
---
SELECT "books".* FROM "books" ORDER BY "books"."author" ASC

      def create
        @book = Book.new(book_params)
        if @book.save
---
INSERT INTO "books" ("title", "author", "price", "published", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Book 1"], ["author", "Steve Jobs"], ["price", 19.99], ["published", "2024-01-02"], ["created_at", "2024-01-28 07:55:12.115013"], ["updated_at", "2024-01-28 07:55:12.115013"]]